tutorials/CFD/19bifurcation_SNN/system/blockMeshDict
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}

convertToMeters 1;
vertices
(
    (0 0 0)
    (10 0 0)
    (10 -2.5 0)
    (50 -2.5 0)
    (50 0 0)
    (50 2.5 0)
    (50 5 0)
    (10 5 0)
    (10 2.5 0)
    (0 2.5 0)
    (0 0 0.1)
    (10 0 0.1)
    (10 -2.5 0.1)
    (50 -2.5 0.1)
    (50 0 0.1)
    (50 2.5 0.1)
    (50 5 0.1)
    (10 5 0.1)
    (10 2.5 0.1)
    (0 2.5 0.1)
);
blocks
(
    hex (0 1 8 9 10 11 18 19) (20 40 1) simpleGrading (1 1 1)
    hex (8 5 6 7 18 15 16 17) (80 40 1) simpleGrading (1 1 1)
    hex (1 4 5 8 11 14 15 18) (80 40 1) simpleGrading (1 1 1)
    hex (2 3 4 1 12 13 14 11) (80 40 1) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 9 19 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 6 16 15)
            (4 5 15 14)
            (3 4 14 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (5 6 7 8)
            (1 4 5 8)
            (1 2 3 4)
            (1 8 9 0)
            (15 16 17 18)
            (11 14 15 18)
            (11 12 13 14)
            (11 18 19 10)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (2 3 13 12)
            (9 8 18 19)
            (7 6 16 17)
            (1 2 12 11)
            (8 7 17 18)
        );
     }
);
mergePatchPairs
(
);
