tutorials/CFD/19bifurcation_SNN/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       20580;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       20620;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20800;
        startFace       20740;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       41540;
    }
)

// ************************************************************************* //
