tutorials/CFD/19bifurcation_SNN/0/Ulift
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
10400
(
(9.00286 -0.932487 0)
(18.0346 -0.196481 0)
(20.0397 -0.0541586 0)
(20.6009 -0.0159889 0)
(20.7674 -0.00482591 0)
(20.8178 -0.00146834 0)
(20.8331 -0.000448157 0)
(20.8378 -0.000137032 0)
...
)
;

boundaryField
{
    inlet
    {
        type            parabolicVelocity;
        maxValue        31.25;
        n               (1 0 0);
        y               (0 1 0);
        value           nonuniform List<vector> 
40
(
(1.54297 0 0)
(4.51172 0 0)
(7.32422 0 0)
(9.98047 0 0)
(12.4805 0 0)
(14.8242 0 0)
(17.0117 0 0)
(19.043 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
