tutorials/CFD/19bifurcation_SNN/system/BIFURCATIONdict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      BIFURCATIONdict;
}



N_mu 5;
mu_inf 1.3;
mu_sup 0.4;
x_cord 20;
y_cord 1.25;
field velocity;
component y;
